app/Controllers/Home.php

    public function browse(){
        $model=new Courses();
        $purchased=new Purchased();
        $chapter=new Chapter();
        //$completed=$chapters['track'];
        $completed=0;
        $courses=$model->where('purchased','paid')->findAll();

        $unpaids=$model->where('purchased','unpaid')->findAll();
        //$status=$arr['status'];

        $chapters=$chapter->where('view_status','open')->where('course_id',$id)->findAll();
---
SELECT *
FROM `courses`
WHERE `purchased` = 'paid'
SELECT *
FROM `courses`
WHERE `purchased` = 'unpaid'
SELECT *
FROM `chapters`
WHERE `view_status` = 'open'
AND `course_id` = '13'